Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pfw.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PFW register API structure */
typedef struct
{  /* flash wrapper */
  __IO  uint32_t                       PFW_IFT_CON;        /**< Offset: 0x00 (R/W  32)  */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCCON;     /**< Offset: 0x10 (R/W  32)  */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCMADR;    /**< Offset: 0x20 (R/W  32)  */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCMLEN;    /**< Offset: 0x30 (R/W  32)  */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCIV;      /**< Offset: 0x40 (R/W  32)  */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCACC;     /**< Offset: 0x50 (R/W  32)  */
  __I   uint8_t                        Reserved6[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCPOLY;    /**< Offset: 0x60 (R/W  32)  */
  __I   uint8_t                        Reserved7[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCFXOR;    /**< Offset: 0x70 (R/W  32)  */
  __I   uint8_t                        Reserved8[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCSUM;     /**< Offset: 0x80 (R/W  32)  */
  __I   uint8_t                        Reserved9[0x0C];
  __IO  uint32_t                       PFW_IFT_ECCCON;     /**< Offset: 0x90 (R/W  32)  */
  __I   uint8_t                        Reserved10[0x0C];
  __IO  uint32_t                       PFW_IFT_ECCFLT;     /**< Offset: 0xA0 (R/W  32)  */
  __I   uint8_t                        Reserved11[0x0C];
  __IO  uint32_t                       PFW_IFT_ECCADR;     /**< Offset: 0xB0 (R/W  32)  */
  __I   uint8_t                        Reserved12[0x0C];
  __IO  uint32_t                       PFW_IFT_ECCPAR;     /**< Offset: 0xC0 (R/W  32)  */
  __I   uint8_t                        Reserved13[0x0C];
  __IO  uint32_t                       PFW_IFT_ECCSYN;     /**< Offset: 0xD0 (R/W  32)  */
  __I   uint8_t                        Reserved14[0x1C];
  __IO  uint32_t                       PFW_DFT_VALCON;     /**< Offset: 0xF0 (R/W  32)  */
  __I   uint8_t                        Reserved15[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP1RR01;  /**< Offset: 0x100 (R/W  32)  */
  __I   uint8_t                        Reserved16[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP1RR23;  /**< Offset: 0x110 (R/W  32)  */
  __I   uint8_t                        Reserved17[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP1RR45;  /**< Offset: 0x120 (R/W  32)  */
  __I   uint8_t                        Reserved18[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP1RR67;  /**< Offset: 0x130 (R/W  32)  */
  __I   uint8_t                        Reserved19[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP2RR01;  /**< Offset: 0x140 (R/W  32)  */
  __I   uint8_t                        Reserved20[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP2RR23;  /**< Offset: 0x150 (R/W  32)  */
  __I   uint8_t                        Reserved21[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP2RR45;  /**< Offset: 0x160 (R/W  32)  */
  __I   uint8_t                        Reserved22[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP2RR67;  /**< Offset: 0x170 (R/W  32)  */
} pfw_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ45_PFW_COMPONENT_H_ */
